Revit 2027 API
RebarHostData.GetFabricSheetsInHost Method
 Returns all FabricSheet elements hosted by the referenced element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<FabricSheet> GetFabricSheetsInHost()
Public Function GetFabricSheetsInHost As IList(Of FabricSheet)
public:
IList<FabricSheet^>^ GetFabricSheetsInHost()
member GetFabricSheetsInHost : unit -> IList<FabricSheet>
Return Value
IList<FabricSheet>
See Also
Reference
RebarHostData Class
Autodesk.Revit.DB.Structure Namespace